andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
    lcd_gpio_write_bus(value);
    delay_cycles(20);
    GPIOB->BSRR = (uint32_t)LCD_CTRL_WR << 16;
    delay_cycles(20);
    GPIOB->BSRR = LCD_CTRL_WR;
    delay_cycles(20);
}

static void lcd_write_cmd(uint16_t cmd)
{
    lcd_gpio_write(cmd, 0);
}

static void lcd_write_data(uint16_t data)
{
    lcd_gpio_write(data, 1);
}

static uint16_t lcd_read_data(void)
{
    return 0xFFFF;
}

static void lcd_write_reg(uint16_t cmd, uint16_t data)
{
    lcd_write_cmd(cmd);
    lcd_write_data(data);
}

static uint16_t LCD_UI_UNUSED lcd_read_id(void)
{
    uint16_t id;

    lcd_write_cmd(0xD3);
    (void)lcd_read_data();
    (void)lcd_read_data();
    id = (uint16_t)(lcd_read_data() << 8);
    id |= lcd_read_data();
    if (id == 0x9341) {
        return id;
    }

    lcd_write_cmd(0x04);
    (void)lcd_read_data();
    (void)lcd_read_data();
    id = (uint16_t)(lcd_read_data() << 8);
    id |= lcd_read_data();
    if (id == 0x8552 || id == 0x7789) {
        return 0x7789;
    }

    return id;
}

static void lcd_ili9341_init(void)
{
    lcd_write_cmd(0x01);
    delay_ms(20);
    lcd_write_cmd(0xCF); lcd_write_data(0x00); lcd_write_data(0xC1); lcd_write_data(0x30);
    lcd_write_cmd(0xED); lcd_write_data(0x64); lcd_write_data(0x03); lcd_write_data(0x12); lcd_write_data(0x81);
    lcd_write_cmd(0xE8); lcd_write_data(0x85); lcd_write_data(0x10); lcd_write_data(0x7A);
    lcd_write_cmd(0xCB); lcd_write_data(0x39); lcd_write_data(0x2C); lcd_write_data(0x00); lcd_write_data(0x34); lcd_write_data(0x02);
    lcd_write_cmd(0xF7); lcd_write_data(0x20);
    lcd_write_cmd(0xEA); lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_reg(0xC0, 0x1B);
    lcd_write_reg(0xC1, 0x01);
    lcd_write_cmd(0xC5); lcd_write_data(0x30); lcd_write_data(0x30);
    lcd_write_cmd(0xC7); lcd_write_data(0xB7);
    lcd_write_reg(0x36, 0x08);
    lcd_write_reg(0x3A, 0x55);
    lcd_write_cmd(0xB1); lcd_write_data(0x00); lcd_write_data(0x1A);
    lcd_write_cmd(0xB6); lcd_write_data(0x0A); lcd_write_data(0xA2);
    lcd_write_reg(0xF2, 0x00);
    lcd_write_reg(0x26, 0x01);
    lcd_write_cmd(0xE0);
    lcd_write_data(0x0F); lcd_write_data(0x2A); lcd_write_data(0x28); lcd_write_data(0x08); lcd_write_data(0x0E);
    lcd_write_data(0x08); lcd_write_data(0x54); lcd_write_data(0xA9); lcd_write_data(0x43); lcd_write_data(0x0A);
    lcd_write_data(0x0F); lcd_write_data(0x00); lcd_write_data(0x00); lcd_write_data(0x00); lcd_write_data(0x00);
    lcd_write_cmd(0xE1);
    lcd_write_data(0x00); lcd_write_data(0x15); lcd_write_data(0x17); lcd_write_data(0x07); lcd_write_data(0x11);
    lcd_write_data(0x06); lcd_write_data(0x2B); lcd_write_data(0x56); lcd_write_data(0x3C); lcd_write_data(0x05);
    lcd_write_data(0x10); lcd_write_data(0x0F); lcd_write_data(0x3F); lcd_write_data(0x3F); lcd_write_data(0x0F);
    lcd_write_cmd(0x11);
    delay_ms(120);
    lcd_write_cmd(0x29);
}

static void LCD_UI_UNUSED lcd_st7789_init(void)
{
    lcd_write_cmd(0x11);
    delay_ms(120);
    lcd_write_reg(0x36, 0x00);
    lcd_write_reg(0x3A, 0x05);
    lcd_write_cmd(0xB2); lcd_write_data(0x0C); lcd_write_data(0x0C); lcd_write_data(0x00); lcd_write_data(0x33); lcd_write_data(0x33);
    lcd_write_reg(0xB7, 0x35);
    lcd_write_reg(0xBB, 0x32);
    lcd_write_reg(0xC0, 0x0C);
    lcd_write_reg(0xC2, 0x01);
    lcd_write_reg(0xC3, 0x10);
    lcd_write_reg(0xC4, 0x20);
    lcd_write_reg(0xC6, 0x0F);
    lcd_write_cmd(0xD0); lcd_write_data(0xA4); lcd_write_data(0xA1);
    lcd_write_cmd(0x21);
    lcd_write_cmd(0x29);
}

static void lcd_set_window(uint16_t x0, uint16_t y0, uint16_t x1, uint16_t y1)
{
    lcd_write_cmd(0x2A);
    lcd_write_data(x0 >> 8); lcd_write_data(x0 & 0xFF);
    lcd_write_data(x1 >> 8); lcd_write_data(x1 & 0xFF);
    lcd_write_cmd(0x2B);
    lcd_write_data(y0 >> 8); lcd_write_data(y0 & 0xFF);
    lcd_write_data(y1 >> 8); lcd_write_data(y1 & 0xFF);
    lcd_write_cmd(0x2C);
}

static void lcd_fill(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
    if (x >= LCD_W || y >= LCD_H) return;
    if ((uint32_t)x + w > LCD_W) w = LCD_W - x;
    if ((uint32_t)y + h > LCD_H) h = LCD_H - y;

    lcd_set_window(x, y, (uint16_t)(x + w - 1U), (uint16_t)(y + h - 1U));
    for (uint32_t i = 0; i < (uint32_t)w * h; i++) {
        lcd_write_data(color);
    }
}

static uint8_t glyph_row(char c, uint8_t row)
{
    static const uint8_t digits[10][7] = {
        {14,17,19,21,25,17,14}, {4,12,4,4,4,4,14}, {14,17,1,2,4,8,31},
        {30,1,1,14,1,1,30}, {2,6,10,18,31,2,2}, {31,16,30,1,1,17,14},
        {6,8,16,30,17,17,14}, {31,1,2,4,8,8,8}, {14,17,17,14,17,17,14},
        {14,17,17,15,1,2,12}
    };
    static const uint8_t letters[26][7] = {
        {14,17,17,31,17,17,17}, {30,17,17,30,17,17,30}, {14,17,16,16,16,17,14},
        {30,17,17,17,17,17,30}, {31,16,16,30,16,16,31}, {31,16,16,30,16,16,16},
        {14,17,16,23,17,17,15}, {17,17,17,31,17,17,17}, {14,4,4,4,4,4,14},
        {7,2,2,2,18,18,12}, {17,18,20,24,20,18,17}, {16,16,16,16,16,16,31},
        {17,27,21,21,17,17,17}, {17,25,21,19,17,17,17}, {14,17,17,17,17,17,14},
        {30,17,17,30,16,16,16}, {14,17,17,17,21,18,13}, {30,17,17,30,20,18,17},
        {15,16,16,14,1,1,30}, {31,4,4,4,4,4,4}, {17,17,17,17,17,17,14},
        {17,17,17,17,17,10,4}, {17,17,17,21,21,21,10}, {17,17,10,4,10,17,17},
        {17,17,10,4,4,4,4}, {31,1,2,4,8,16,31}
    };

    if (c >= '0' && c <= '9') return digits[c - '0'][row];
    if (c >= 'a' && c <= 'z') c = (char)(c - 'a' + 'A');
    if (c >= 'A' && c <= 'Z') return letters[c - 'A'][row];
    switch (c) {
        case ' ': return 0;
        case '%': { static const uint8_t p[7] = {25,25,2,4,8,19,19}; return p[row]; }
        case '.': return row == 6 ? 4 : 0;
        case ':': return (row == 2 || row == 4) ? 4 : 0;
        case '-': return row == 3 ? 31 : 0;
        case '/': return (uint8_t)(1U << (4U - (row > 4 ? 4 : row)));
        default: return 0;
    }
}

static void draw_char(uint16_t x, uint16_t y, char c, uint16_t fg, uint16_t bg, uint8_t scale)
{
    for (uint8_t row = 0; row < 7; row++) {
        uint8_t bits = glyph_row(c, row);
        for (uint8_t col = 0; col < 5; col++) {
            uint16_t color = (bits & (1U << (4U - col))) ? fg : bg;
            lcd_fill((uint16_t)(x + col * scale), (uint16_t)(y + row * scale), scale, scale, color);
        }
    }
}

static void draw_text(uint16_t x, uint16_t y, const char *s, uint16_t fg, uint16_t bg, uint8_t scale)
{
    while (*s) {
        draw_char(x, y, *s++, fg, bg, scale);
        x = (uint16_t)(x + 6U * scale);
    }
}

static void u16_to_dec(uint16_t value, char *out)
{
    char temp[6];
    uint8_t i = 0;

