andybi0403/STM32H7-Elderly-Care-System/firmware/module_tests/virtual UI/UI/lcd_ui.c
    if (value == 0) {
        out[0] = '0';
        out[1] = '\0';
        return;
    }

    while (value && i < sizeof(temp)) {
        temp[i++] = (char)('0' + (value % 10U));
        value /= 10U;
    }

    for (uint8_t j = 0; j < i; j++) {
        out[j] = temp[i - 1U - j];
    }
    out[i] = '\0';
}

static void draw_panel(uint16_t x, uint16_t y, uint16_t w, uint16_t h, uint16_t color)
{
    lcd_fill(x, y, w, h, color);
    lcd_fill(x, y, w, 2, COLOR_GRAY);
    lcd_fill(x, (uint16_t)(y + h - 2), w, 2, COLOR_GRAY);
    lcd_fill(x, y, 2, h, COLOR_GRAY);
    lcd_fill((uint16_t)(x + w - 2), y, 2, h, COLOR_GRAY);
}

static void draw_progress(uint16_t x, uint16_t y, uint16_t w, uint16_t val100, uint16_t color)
{
    uint16_t fill;
    if (val100 > 100U) val100 = 100U;
    fill = (uint16_t)(((uint32_t)w * val100) / 100U);
    lcd_fill(x, y, w, 10, COLOR_TRACK);
    lcd_fill(x, y, fill, 10, color);
    lcd_fill(x, y, w, 1, COLOR_WHITE);
    lcd_fill(x, (uint16_t)(y + 9U), w, 1, COLOR_DARK);
}

static void draw_status_dot(uint16_t x, uint16_t y, uint16_t color)
{
    lcd_fill(x, y, 12, 12, color);
    lcd_fill((uint16_t)(x + 3U), (uint16_t)(y + 3U), 6, 6, COLOR_WHITE);
}

static void draw_num(uint16_t x, uint16_t y, uint16_t value, uint16_t fg, uint16_t bg, uint8_t scale);

static void draw_meter_card(uint16_t x, uint16_t y, const char *label, uint16_t value,
                            const char *unit, uint16_t val100, uint16_t color)
{
    draw_panel(x, y, 108, 74, COLOR_PANEL);
    draw_status_dot((uint16_t)(x + 8U), (uint16_t)(y + 8U), color);
    draw_text((uint16_t)(x + 26U), (uint16_t)(y + 10U), label, COLOR_DARK, COLOR_PANEL, 1);
    draw_num((uint16_t)(x + 14U), (uint16_t)(y + 30U), value, color, COLOR_PANEL, 2);
    draw_text((uint16_t)(x + 66U), (uint16_t)(y + 38U), unit, COLOR_DARK, COLOR_PANEL, 1);
    draw_progress((uint16_t)(x + 12U), (uint16_t)(y + 58U), 84, val100, color);
}

static void draw_button(uint16_t x, uint16_t y, uint16_t w, uint16_t h, const char *label, uint8_t active)
{
    uint16_t bg = active ? COLOR_HEADER : COLOR_NAV;
    lcd_fill(x, y, w, h, bg);
    lcd_fill(x, y, w, 1, COLOR_WHITE);
    lcd_fill(x, (uint16_t)(y + h - 2U), w, 2, active ? COLOR_ACCENT : COLOR_DARK);
    draw_text((uint16_t)(x + 8U), (uint16_t)(y + 8U), label, COLOR_WHITE, bg, 1);
}

static void draw_num(uint16_t x, uint16_t y, uint16_t value, uint16_t fg, uint16_t bg, uint8_t scale)
{
    char text[6];
    u16_to_dec(value, text);
    draw_text(x, y, text, fg, bg, scale);
}

static void draw_temp(uint16_t x, uint16_t y, int16_t c10, uint16_t fg, uint16_t bg, uint8_t scale)
{
    char text[8];
    uint16_t v = c10 < 0 ? (uint16_t)-c10 : (uint16_t)c10;
    char whole[5];
    char frac[2];

    u16_to_dec((uint16_t)(v / 10U), whole);
    u16_to_dec((uint16_t)(v % 10U), frac);
    uint8_t p = 0;
    if (c10 < 0) text[p++] = '-';
    for (uint8_t i = 0; whole[i] != '\0'; i++) text[p++] = whole[i];
    text[p++] = '.';
    text[p++] = frac[0];
    text[p++] = 'C';
    text[p] = '\0';
    draw_text(x, y, text, fg, bg, scale);
}

static void draw_header(const char *title)
{
    lcd_fill(0, 0, LCD_W, LCD_H, COLOR_BG);
    lcd_fill(0, 0, LCD_W, 30, COLOR_HEADER);
    draw_text(8, 8, title, COLOR_WHITE, COLOR_HEADER, 2);
    draw_text(154, 10, g_ui_data.wifi_connected ? "LINK" : "NO LINK", COLOR_WHITE, COLOR_HEADER, 1);
    if (g_ui_data.alarm_active) {
        lcd_fill(208, 4, 28, 22, COLOR_RED);
        draw_text(214, 11, "A", COLOR_WHITE, COLOR_RED, 1);
    }
}

static void draw_nav(void)
{
    draw_button(0, 286, 60, 34, "KEY0", g_current_page == 0);
    draw_button(60, 286, 60, 34, "KEY1", g_current_page == 1);
    draw_button(120, 286, 60, 34, "KEY2", g_current_page == 2);
    draw_button(180, 286, 60, 34, "WKUP", g_current_page == 3);
}

static void draw_home(void)
{
    draw_header("ELDER CARE");

    draw_meter_card(8, 38, "HEART", g_ui_data.heart_rate, "BPM",
                    (uint16_t)((g_ui_data.heart_rate > 120U) ? 100U : (g_ui_data.heart_rate * 100U / 120U)), COLOR_RED);
    draw_meter_card(124, 38, "SPO2", g_ui_data.spo2, "%",
                    g_ui_data.spo2, COLOR_BLUE);

    draw_panel(8, 116, 224, 58, COLOR_PANEL);
    draw_status_dot(20, 128, g_ui_data.servo_open ? COLOR_ORANGE : COLOR_GREEN);
    draw_text(42, 128, "PILL BOX", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(42, 150, "SLOT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(86, 144, g_ui_data.pillbox_slot, COLOR_ORANGE, COLOR_PANEL, 2);
    draw_text(138, 150, g_ui_data.servo_open ? "OPEN" : "READY", g_ui_data.servo_open ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 182, 224, 92, COLOR_PANEL);
    draw_text(20, 194, "SYSTEM FLOW", COLOR_DARK, COLOR_PANEL, 1);
    draw_progress(20, 216, 188, 78, COLOR_ACCENT);
    draw_text(20, 234, "RTC PILL HX711", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 252, g_ui_data.alarm_active ? "ALARM ACTIVE" : "NORMAL MONITOR", g_ui_data.alarm_active ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_nav();
}

static void draw_health(void)
{
    draw_header("HEALTH DETAIL");
    draw_panel(8, 38, 224, 64, COLOR_PANEL);
    draw_status_dot(20, 50, COLOR_RED);
    draw_text(42, 48, "HEART RATE", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(42, 66, g_ui_data.heart_rate, COLOR_RED, COLOR_PANEL, 2);
    draw_text(96, 74, "BPM", COLOR_DARK, COLOR_PANEL, 1);
    draw_progress(130, 72, 82, (uint16_t)(g_ui_data.heart_rate * 100U / 120U), COLOR_RED);

    draw_panel(8, 110, 224, 64, COLOR_PANEL);
    draw_status_dot(20, 122, COLOR_BLUE);
    draw_text(42, 120, "BLOOD OXYGEN", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(42, 138, g_ui_data.spo2, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(88, 146, "%", COLOR_DARK, COLOR_PANEL, 1);
    draw_progress(130, 144, 82, g_ui_data.spo2, COLOR_BLUE);

    draw_panel(8, 182, 224, 40, COLOR_PANEL);
    draw_text(20, 194, "TEMP", COLOR_DARK, COLOR_PANEL, 1);
    draw_temp(84, 190, g_ui_data.temperature_c10, COLOR_GREEN, COLOR_PANEL, 2);

    draw_panel(8, 230, 224, 44, COLOR_PANEL);
    draw_text(20, 242, "POSTURE", COLOR_DARK, COLOR_PANEL, 1);
    draw_text(100, 242, g_ui_data.fall_detected ? "FALL RISK" : "STABLE", g_ui_data.fall_detected ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);
    draw_nav();
}

static void draw_pill(void)
{
    draw_header("PILL DETAIL");
    draw_panel(8, 38, 224, 62, COLOR_PANEL);
    draw_status_dot(20, 50, COLOR_ORANGE);
    draw_text(42, 48, "NEXT SLOT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(42, 66, g_ui_data.pillbox_slot, COLOR_ORANGE, COLOR_PANEL, 2);
    draw_text(96, 74, g_ui_data.servo_open ? "OPEN" : "READY", g_ui_data.servo_open ? COLOR_RED : COLOR_GREEN, COLOR_PANEL, 1);

    draw_panel(8, 108, 224, 62, COLOR_PANEL);
    draw_text(20, 118, "WEIGHT", COLOR_DARK, COLOR_PANEL, 1);
    draw_num(20, 136, g_ui_data.pill_weight_g, COLOR_BLUE, COLOR_PANEL, 2);
    draw_text(82, 144, "G", COLOR_DARK, COLOR_PANEL, 1);
    draw_progress(112, 142, 96, (uint16_t)((g_ui_data.pill_weight_g > 200U) ? 100U : (g_ui_data.pill_weight_g / 2U)), COLOR_BLUE);

    draw_panel(8, 178, 224, 96, COLOR_PANEL);
    draw_text(20, 190, "SERVO MG90S", COLOR_DARK, COLOR_PANEL, 1);
    draw_progress(20, 212, 188, g_ui_data.servo_open ? 88 : 50, COLOR_ORANGE);
    draw_text(20, 232, "PWM 50HZ  MG90S", COLOR_BLUE, COLOR_PANEL, 1);
    draw_text(20, 252, "RTC REMIND OPEN", COLOR_GREEN, COLOR_PANEL, 1);
    draw_nav();
}

